{
    "en": {
      "about_title": "About Me",
      "projects_title": "Projects",
      "contact_title": "Contacts",
      "explore_projects": "Explore my projects →",
      "game_developer": "Game Developer with skills in game design and programming.",
      "greeting": "Hello! I’m a",
      "greeting_details_1": "passionate about the craft of creating engaging and meaningful interactive experiences.",
      "greeting_details_2": "I thrive where design and code meet — blending gameplay mechanics, level design, and clean code to bring ideas to life.",
      "head_list": "I love:",
      "list_1": "Designing intuitive and enjoyable game experiences",
      "list_2": "Writing clean, efficient, and maintainable code",
      "list_3": "Working in teams to solve creative and technical challenges",
      "tail_list": "I'm driven by curiosity, a desire to learn, and the goal of building games that connect with people.",
      "download_title": "Download",
      "cv_description": "CV with my work experience, hobbies, and volunteering.",
      "cv_button": "Download my CV",
      "certificate_description": "Training certificate in video game creation with Unreal Engine 5 and C++.",
      "certificate_button": "Download my Certificate",
      "project_polar_title": "Polar Platformer",
      "project_polar_short": "A 3D platformer set in a frozen kingdom.",
      "project_polar_full": "A 3D platformer. You play as a penguin exploring snowy islands and reconnecting the world through gameplay. key features are: destroyable objects, dynamic objects creation using blueprint variables, animations and physics",
      "project_kickerz_title": "Mega Kickerz",
      "project_kickerz_short": "An arcade soccer game",
      "project_kickerz_full": "Mega Kickerz is an action-packed arcade soccer game where scoring goals is only half the fun. Players must skillfully use ball bounces off the stadium walls and unleash powerful hits to knock opponents out of the way. The game focuses heavily on physics-based gameplay, dynamic object impulses, and fast-paced multiplayer matches. It also features character customization system.",
      "project_tank_title": "Tank Training Grounds",
      "project_tank_short": "A combat-focused tank game.",
      "project_tank_full": "Tank Training Grounds is a combat-focused tank game developed during my Unreal Engine 5 course. Built as part of my training certification, the game explores core gameplay systems such as AI-controlled enemies, health and damage management, combat effects, and a responsive HUD.",
      "projects_description":"My game development journey combines technical and creative skills. I’m proficient with Blueprints and C++, experienced in input systems, animation states, events, HUDs, and actor management. In personal projects, I also handle character animations and 3D modeling, shaping gameplay and visuals end-to-end—from code to art.",
      "contact_intro": "Feel free to reach out using the form below or via email.",
      "contact_name": "Your Name",
      "contact_email": "Your Email",
      "contact_message": "Your Message",
      "contact_button": "Send Message",
      "tap_to_expand": "Tap to expand"
    },
    "it": {
      "about_title": "Chi sono",
      "projects_title": "Progetti",
      "contact_title": "Contatti",
      "explore_projects": "Esplora i miei progetti →",
      "game_developer": "Game Developer con competenze in design e programmazione di videogiochi",
      "greeting": "Ciao! Sono un",
      "greeting_details_1": "appassionato del creare esperienze interattive coinvolgenti e significative.",
      "greeting_details_2": "Mi trovo a mio agio dove si incontrano design e codice — unendo meccaniche di gioco, level design e codice pulito per dare vita alle idee.",
      "head_list": "Amo:",
      "list_1": "Progettare esperienze di gioco intuitive e coinvolgenti",
      "list_2": "Scrivere codice pulito, efficiente e manutenibile",
      "list_3": "Collaborare con i team per dare vita a idee creative",
      "tail_list": "Sono guidato dalla curiosità, dalla voglia di imparare e dall’obiettivo di realizzare giochi che emozionino e coinvolgano i giocatori.",
      "download_title": "CV e Certificati",
      "cv_description": "CV con le mie esperienze lavorative, hobby e volontariato.",
      "cv_button": "Scarica il mio CV",
      "certificate_description": "Certificato di training nella creazione di videogiochi con Unreal Engine 5 e C++.",
      "certificate_button": "Scarica il mio Certificato",
      "project_polar_title": "Platformer Polare",
      "project_polar_short": "Un platformer 3D ambientato in un regno ghiacciato.",
      "project_polar_full": "Un platformer 3D. Vesti i panni di un pinguino che esplora isole innevate e riconnette il mondo attraverso il gameplay. Le funzionalità principali includono: oggetti distruttibili, creazione dinamica di oggetti tramite variabili blueprint, animazioni e fisica.",
      "project_kickerz_title": "Mega Kickerz",
      "project_kickerz_short": "Un gioco di calcio arcade.",
      "project_kickerz_full": "Mega Kickerz è un gioco di calcio arcade ricco di azione in cui fare gol è solo metà del divertimento. I giocatori devono sfruttare abilmente i rimbalzi della palla sulle pareti dello stadio e colpire gli avversari per farsi strada. Il gioco punta molto su una fisica realistica, impulsi dinamici sugli oggetti, partite multiplayer frenetiche e un sistema di personalizzazione del personaggio.",
      "project_tank_title": "Campo di Addestramento Tank",
      "project_tank_short": "Un gioco di carri armati orientato al combattimento.",
      "project_tank_full": "Campo di Addestramento Tank è un gioco di carri armati focalizzato sul combattimento, sviluppato durante il mio corso su Unreal Engine 5. Creato come parte della mia certificazione, il gioco esplora sistemi di gameplay fondamentali come nemici controllati da IA, gestione della salute e dei danni, effetti di combattimento e un HUD reattivo.",
      "projects_description": "Il mio percorso nello sviluppo giochi unisce competenze tecniche e creative. Sono esperto in Blueprints e C++, con esperienza in sistemi di input, stati di animazione, eventi, HUD e gestione degli attori. Nei miei progetti personali curo anche animazioni e modellazione 3D, creando gameplay e grafica dall’inizio alla fine.",
      "contact_intro": "Scrivimi pure tramite il modulo qui sotto o via email.",
      "contact_name": "Il tuo nome",
      "contact_email": "La tua email",
      "contact_message": "Il tuo messaggio",
      "contact_button": "Invia messaggio",
      "tap_to_expand": "tocca per espandere"
    }
  }